blog/app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @user = User.find_by_email(params[:email])
    @post = Post.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id if current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdasd"], ["title", "asdasd"], ["content", "asdasd"], ["user_id", 7], ["created_at", "2015-10-19 21:43:38.310220"], ["updated_at", "2015-10-19 21:43:38.310220"]]

  def update
    @post = Post.find params[:id]
    @post.user_id = current_user.id if current_user
    respond_to do |format|
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "posts" SET "name" = ?, "title" = ?, "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "post"], ["title", "post"], ["content", "post"], ["user_id", nil], ["updated_at", "2015-10-20 19:59:04.500757"], ["id", 16]]

  def destroy
    @post = Post.find(params[:id])
    if @post.present?
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]