blog/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users"
---
	def new
		@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "hi@hi"]]
---
  def create
    puts params[:email]
    user = User.find_by_email(params[:session][:email])