blog/app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["fname", "asdasd"], ["lname", "asdasd"], ["email", "cat@sat"], ["password", "sat"], ["created_at", "2015-10-19 15:48:55.369509"], ["updated_at", "2015-10-19 15:48:55.369509"]]

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]

  def update
    @user = User.find params[:id]
    @user.update_attributes params[:user]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "fname" = ?, "lname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "elisesese"], ["lname", "sese"], ["password_digest", "$2a$10$w/2L5qGXJ4YpchNzQdhUBOY5HVu6vsaOhUXKQ/NhHa3e4Vf2jB8kO"], ["updated_at", "2015-10-19 20:25:13.969287"], ["id", 4]]

  def destroy
    @user = User.find params[:id]
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]