app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "asdasd"], ["body", "asdasd"], ["post_id", 1], ["created_at", "2015-10-19 15:49:17.809164"], ["updated_at", "2015-10-19 15:49:17.809164"]]
---
	  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])